from src.tools.storage.state_store.redis_usage.redis_connection import redis_connection
from typing import Dict, Any, Optional
from src.tools.storage.state_store.redis_usage.redis_usage import get_user, save_user
import src.utils.classifier.classifier as clsf
from src.utils.gpt_utils import usable_context
from src.utils.classifier.summary import summarize


def test_user_data():
    return {
        "user_id": str(1741535),

        "context": """Bot: Доброе утро! 🌞
Сегодня отличный день, чтобы начать с маленькой победы. Давай выполним задания прямо сейчас — так у тебя останется больше времени для отдыха и любимых дел вечером.
 Bot: НАПОМИНАНИЕ!
Медина, у вас все получится!
Вы уже на пути к успеху!  Завершите задание до 00:00, и пусть еще один шаг приведет вас к новым достижениям🚀
Если же у вас нет возможности выполнить задание, вы можете поставить "заморозку" и сохранить свой день.
Главное – не останавливаться, ведь результат не заставит себя ждать! Не забывайте, менторы всегда рядом, стоит лишь нам написать✨

 Bot: Умничка, Медина!

На сегодня вы завершили свои задания, отличная работа! Ваш ежедневный труд - большая ценность, каждый день вы становитесь все лучше и лучше в математике, мы гордимся вами! Продолжайте в том же духе✨

Если у вас есть какие-либо трудности или вопросы, не стесняйтесь спрашивать, мы всегда рады вам помочь.
Как вы оцениваете задание сегодняшнего дня?

 Bot: Доброе утро! 🌞
Сегодня отличный день, чтобы начать с маленькой победы. Давай выполним задания прямо сейчас — так у тебя останется больше времени для отдыха и любимых дел вечером.
 Pupil: как снять деньги
 Pupil: ?
 Pupil: как снять деньги""",

        "full_context": str([{"date":"2025-11-17 09:57:03","text":"Доброе утро! 🌞\r\nСегодня отличный день, чтобы начать с маленькой победы. Давай выполним задания прямо сейчас — так у тебя останется больше времени для отдыха и любимых дел вечером.","sender_type":"Bot"},{"date":"2025-11-17 18:38:10","text":"НАПОМИНАНИЕ!\nМедина, у вас все получится!\nВы уже на пути к успеху!  Завершите задание до 00:00, и пусть еще один шаг приведет вас к новым достижениям🚀\nЕсли же у вас нет возможности выполнить задание, вы можете поставить \"заморозку\" и сохранить свой день.\nГлавное – не останавливаться, ведь результат не заставит себя ждать! Не забывайте, менторы всегда рядом, стоит лишь нам написать✨\n","sender_type":"Bot"},{"date":"2025-11-17 18:52:55","text":"Умничка, Медина!\n\nНа сегодня вы завершили свои задания, отличная работа! Ваш ежедневный труд - большая ценность, каждый день вы становитесь все лучше и лучше в математике, мы гордимся вами! Продолжайте в том же духе✨\n\nЕсли у вас есть какие-либо трудности или вопросы, не стесняйтесь спрашивать, мы всегда рады вам помочь.\nКак вы оцениваете задание сегодняшнего дня?\n","sender_type":"Bot"},{"date":"2025-11-18 10:01:34","text":"Доброе утро! 🌞\r\nСегодня отличный день, чтобы начать с маленькой победы. Давай выполним задания прямо сейчас — так у тебя останется больше времени для отдыха и любимых дел вечером.","sender_type":"Bot"},{"date":"2025-11-18 15:12:19","text":"как снять деньги","sender_type":"pupil"},{"date":"2025-11-18 15:13:18","text":"?","sender_type":"pupil"},{"date":"2025-11-18 15:15:45","text":"как снять деньги","sender_type":"pupil"}])[1:-1],

        "session_context": str([{"date":"2025-11-18 15:12:19","text":"как снять деньги","sender_type":"pupil"},{"date":"2025-11-18 15:13:18","text":"?","sender_type":"pupil"},{"date":"2025-11-18 15:15:45","text":"как снять деньги","sender_type":"pupil"},{"date":"2025-11-18 15:15:56","text":"как снять деньги","sender_type":"pupil"}])[1:-1]
    }


def test_summarize(test_data: Dict[str, Any] = None):
    if test_data is None:
        test_data = test_user_data()
    summary = summarize(usable_context=test_data["full_context"])
    return summary


def test_classifier(test_data: Dict[str, Any] = None):
    if test_data is None:
        test_data = test_user_data()

    classifier_result = clsf.classify(
        usable_context=usable_context(context=test_data["context"],
                                      session_context=test_data["session_context"],
                                      full_context=test_data["full_context"]),

    )

    return classifier_result


def test_save_classifier_result(test_data: Dict[str, Any] = None):
    if test_data is None:
        test_data = test_user_data()

    classifier_result = test_classifier(test_data)
    try:
        save_user(user_id=test_data["user_id"],
                  user_data=classifier_result)

        got = get_user(test_data["user_id"])
        if got is None:
            raise ValueError(f"Ключ не записался в Редис")

        return got

    except Exception as e:
        raise


if __name__ == "__main__":
    try:
        redis_connection.info()

    except Exception as redis_connection_problem:
        # change it
        raise ConnectionError(f"no connection redis {redis_connection_problem}") from redis_connection_problem

    import pytest
    pytest.main([__file__, "-v", "-s"])

