easy_answer_list = ['Здравствуйте! Отлично! Задания выполнены на хорошем уровне, завтра постарайтесь выполнить еще лучше. Молодец!',
        'Молодец! Сегодня вы показали хороший результат. Задание выполнено полностью и очень хорошо. Если не отступите от этого уровня, сможете добиться еще больших результатов.',
        'Молодец! Вы успешно выполнили сегодняшнее задание.',
        'Молодец! Не отступайте от этого уровня!',
        'Замечательно! Сегодня вы отлично выполнили задания. Сохраните этот уровень. Молодец!',
        'Отлично! Задания выполнены на хорошем уровне, я уверена, что завтра вы постараетесь еще лучше. Молодец!'
]

normal_answer_list = ['Вы полностью выполнили задания сегодняшнего дня. Молодец! Завтра мы ждем такого же результата.',
        'Молодец! Достичь конца - это героизм! Уверена, что с такой настойчивостью эти задания впоследствии окажутся для вас легкими! Удачи!',
        'Молодец! Вы полностью завершили задание на сегодня. Уверена, что завтра выполните задание в том же темпе. Удачи!',
        'Замечательно! Вы полностью выполнили задания на сегодня. Не отступайте от этого уровня, молодец! Завтра ожидаю такого же результата!',
        'Молодец! Сегодня вы показали хороший результат. Задание выполнено полностью и очень хорошо. Если не отступите от этого уровня, сможете добиться еще больших результатов.'
]

hard_answer_list = ['Если задания трудные, мы просим вас следовать нашим 4 шагам. 1. Шаг - посмотрите ТЕОРИЮ. Если после этого не сможете решить задачу, 2. шаг - посмотрите ВИДЕОУРОК, запишите в тетрадь и попробуйте еще раз решить следующую задачу. Если это тоже не поможет, 3. шаг - посмотрите РЕШЕНИЕ ЗАДАЧИ и запишите его в тетрадь, затем постарайтесь решить следующую задачу, опираясь на него. Если после этих 3 шагов задачи все еще не удается решить, не забудьте о 4 шаге - помощь МЕНТОРОВ. Если вы пришлете нам записанные задачи и попросите помощь, мы обязательно свяжемся с вами и будем разбирать вместе.',
        'Несмотря на трудности, вы полностью завершили свои задания. Молодец! Не отступайте от этого уровня! Если не отступите от этого уровня, сможете добиться еще больших результатов.'
        'Если задания становятся трудными, это признак того, что ваш уровень повысился. Мы уверены, что завтра вы выполните задания еще лучше, для этого тщательно посмотрите видеоуроки. Если после полного использования всех возможностей у вас все еще есть трудности с задачами, напишите здесь. Вы сможете все! Молодец!',
        'Молодец, даже если задание оказалось трудным, вы полностью его решили. Если вы укажете, какая задача вызвала трудности, мы обсудим ее вместе.'
        'Молодец! Сегодня вы показали хороший результат. Задание выполнено блестяще. Если не отступите от этого уровня, сможете добиться еще больших результатов.'
]

task_will_be_done_today = ['Супер! Рад слышать. Верю, что у тебя всё получится до конца дня!',
        'Отличный настрой! Действуй, дедлайн уже близко, но ты точно справишься.',
        'Принято! Желаю продуктивной работы. Если возникнут сложности — пиши.',
        'Класс! Твоя решительность вдохновляет. Жду выполненных заданий до полуночи.',
        'Записал. Удачи с задачами, ты на верном пути!'
]

task_will_be_done_other_day = ['Мы верим в тебя! Хочешь, оформим заморозку на сегодня?',
        'Понимаю, планы иногда меняются. Не переживай, ты обязательно со всем разберешься позже! Давай поставим заморозку, чтобы прогресс не сгорел?',
        'Жаль, что сегодня не получается, но твой отдых или дела тоже важны. Мы в тебя верим! Предлагаю воспользоваться заморозкой, чтобы спокойно доделать всё завтра.',
        'Бывает и такое! Главное, что ты на связи. Ты крутой ученик, и у тебя всё получится. Оформить тебе заморозку до завтра?',
        'Не расстраивайся! Иногда нужно сделать паузу, чтобы потом выложиться на все сто. Мы с тобой! Давай активируем заморозку?',
        'Твой путь — это марафон, а не спринт. Мы верим в твои силы! Чтобы не терять темп, можем поставить заморозку на этот день. Делаем?'
]