evaluation_list_easy = ['оңац', 'кушті', 'қызық', 'ұнады', 'кушты', 'жеңіл', 'онаи', 'онпй', 'онай', '10/%', '100',
                            'оңай', 'жақсы', 'жаксы', 'женил', 'женіл',
                            'унады', 'ұнады','ұнад', 'унад', 'easy', 'она', 'ойнай', 'жахсы', 'тамаша', 'күшті', 'кызыкты', 'женіл', 'күшт',
                            'оңаи', '10/', 'оңа', 'жоғары', 'легко', 'хорошо', 'отлично', 'лег', 'понравилось', 'высоко', 'нрав',
                        'понра', '5', 'звёзд', 'звезд', 'оцени', '10/']

evaluation_list_normal = ['norm', 'норм', 'бағалаймын', 'болат', 'ортанша', 'орташ', 'ортащ', 'болады', 'ораша',
                              '/10', 'средне', 'нормально']

evaluation_list_hard = ['қиын', 'йын', 'қин', 'ұнаған жоқ', 'унаган жок', 'унамады', 'ұнамады',  '', 'иын', 'киын', 'кин', 'hard', 'тежало', 'трудно', 'тяжело', 'слож', 'срд', 'спед']

responses_today = [
    'успею', 'сделаю', 'сегодня закрою', 'до 00:00 успею', 'да', 'иә', 'я', 'успею конечно',
    'today', 'i will do it', 'yes', 'ок успею', 'қазір істеймін', 'бүгін бітіремін', 'бугин',
    'постараюсь сегодня', 'попробую до вечера', 'кешке дейін', 'до двенадцати успею',
    'сделаю всё', 'уже делаю', 'бітіріп жатырмын', '12-ге дейін жіберем', 'успею',
    'ok today', 'done today', 'к вечеру скину', 'бүгін болады', 'успею до 00:00'
]

responses_not_today = [
    'не успею', 'завтра', 'ертең', 'фриз', 'not today', 'ертен',
    'ертең істеймін', 'завтра сделаю', 'не смогу сегодня', 'кейін', 'потом', 'басқа күні', 'не получается',
    'жасап үлгермеймін', 'ауырып қалдым', 'ертенге калдырайыкшы', 'занят', 'не смогу', 'форс мажор',
    'no', 'tomorrow', 'басқа уақытта', 'кешірек', 'кейінірек', 'завтра скину', 'үлгермей жатырмын'
]